olliw42/stm32ll-lib/src/stdstm32-uartb.h
#elif defined UARTB_USE_UART6 || defined UARTB_USE_UART6_REMAPPED
  #define UARTB_UARTx             USART6
  #ifdef UARTB_USE_UART6
    #define UARTB_TX_IO           IO_PC6
    #define UARTB_RX_IO           IO_PC7
  #else
    #define UARTB_TX_IO           IO_PG14
    #define UARTB_RX_IO           IO_PG9
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              USART6_IRQn
  #define UARTB_IRQHandler        USART6_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTB_USE_UART7 || defined UARTB_USE_UART7_REMAPPED
  #define UARTB_UARTx             UART7
  #ifdef UARTB_USE_UART7
    #define UARTB_TX_IO           IO_PE8
    #define UARTB_RX_IO           IO_PE7
  #else
    #define UARTB_TX_IO           IO_PF7
    #define UARTB_RX_IO           IO_PF6
  #endif
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART7_IRQn
  #define UARTB_IRQHandler        UART7_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTB_USE_UART8
  #define UARTB_UARTx             UART8
  #define UARTB_TX_IO             IO_PE1
  #define UARTB_RX_IO             IO_PE0
  #define UARTB_IO_AF             IO_AF_8
  #define UARTB_IRQn              UART8_IRQn
  #define UARTB_IRQHandler        UART8_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UARTB_USE_LPUART1 || defined UARTB_USE_LPUART1_REMAPPED
  #define UARTB_UARTx             LPUART1
  #ifdef UARTB_USE_LPUART1
    #define UARTB_TX_IO           IO_PA2
    #define UARTB_RX_IO           IO_PA3
  #elif defined UARTB_USE_LPUART1_REMAPPED
    #define UARTB_TX_IO           IO_PC1
    #define UARTB_RX_IO           IO_PC0
  #endif
  #define UARTB_IO_AF             IO_AF_12
  #define UARTB_IRQn              LPUART1_IRQn
  #define UARTB_IRQHandler        LPUART1_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error UART8 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#else
  #error No UARTB_USE_UARTx defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Also, both USART and LPUART use the same structure USART_TypeDef.
// All LL_USART_xx() and LL_LPUART_xx() functions which only use it and relate to flags or 
// registers can be used for both USART and LPUART. 
// Below we simply use the LL_USART_xx() functions for both.


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  USART_SR_RXNE
  #define FLAG_SR_ORE   USART_SR_ORE
  #define FLAG_SR_NE    USART_SR_NE
  #define FLAG_SR_FE    USART_SR_FE
  #define FLAG_SR_TXE   USART_SR_TXE
  #define FLAG_SR_TC    USART_SR_TC
#elif defined STM32F3 || defined STM32F7 || defined STM32L4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE
  #define FLAG_SR_TC    USART_ISR_TC
#elif defined STM32G4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    USART_ISR_TC
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR

void UARTB_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTB_UARTx, REG_SR); // read USART_SR register

#ifdef UARTB_USE_RX
  if (usart_sr & FLAG_SR_RXNE) {
#ifdef UARTB_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartb_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartb_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartb_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTB_RX_CALLBACK_FULL
    UARTB_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartb_rxwritepos + 1) & UARTB_RXBUFSIZEMASK;
    if (uartb_rxreadpos != next) { // fifo not full
      uartb_rxbuf[next] = usart_dr;
      uartb_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTB_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#elif defined STM32F3
  #warning UARTB F3 check clear flags, should be LL !?
  // ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF | USART_ICR_IDLECF));
#elif defined STM32F7
  #warning UARTB F7 check clear flags, should be LL !?
  // these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32G4
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32L4
  #warning UARTB L4 check clear flags, should be LL !?
  LL_USART_WriteReg(UARTB_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#endif
#endif

#ifdef UARTB_USE_TX_ISR
  if (usart_sr & FLAG_SR_TXE) {
    if (uartb_txwritepos != uartb_txreadpos) { // fifo not empty
      uartb_txreadpos = (uartb_txreadpos + 1) & UARTB_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTB_UARTx, uartb_txbuf[uartb_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTB_UARTx); // disable interrupt when empty
#ifdef UARTB_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTB_UARTx); // now enable TC interrupt
      LL_USART_EnableIT_TC(UARTB_UARTx);
#endif
    }
  }

