olliw42/stm32ll-lib/src/stdstm32-uartb.h
#ifdef UARTB_TC_CALLBACK
  if (usart_sr & FLAG_SR_TC) {
    LL_USART_DisableIT_TC(UARTB_UARTx);
    LL_USART_ClearFlag_TC(UARTB_UARTx);
    UARTB_TC_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTB_USE_RX || defined UARTB_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTB_USE_TX

uint16_t uartb_putc(char c)
{
#ifndef UARTB_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UARTB_UARTx)) {}
  LL_USART_TransmitData8(UARTB_UARTx, c);
  return 1;
#else
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  if (uartb_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uartb_txbuf[next] = c;
    uartb_txwritepos = next;
    LL_USART_EnableIT_TXE(UARTB_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


void uartb_puts(const char *s)
{
  while (*s) {
    uartb_putc(*s);
    s++;
  }
}


void uartb_putbuf(uint8_t* buf, uint16_t len)
{
uint16_t i;

  for (i = 0; i < len; i++) uartb_putc(buf[i]);
}


#ifdef UARTB_USE_TX_ISR
uint16_t uartb_tx_notfull(void)
{
  uint16_t next = (uartb_txwritepos + 1) & UARTB_TXBUFSIZEMASK;
  return (uartb_txreadpos != next); // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
}


static inline uint16_t uartb_tx_isempty(void)
{
  if (uartb_txwritepos == uartb_txreadpos) return 1;
  return 0;
}


static inline void uartb_tx_flush(void)
{
  uartb_txwritepos = uartb_txreadpos = 0;
}
#else
static inline void uartb_tx_flush(void) {}
#endif

#endif // defined UARTB_USE_TX


//-------------------------------------------------------
// RX routines
//-------------------------------------------------------
#ifdef UARTB_USE_RX

static inline uint16_t uartb_rx_available(void)
{
  if (uartb_rxwritepos == uartb_rxreadpos) return 0; // fifo empty
  return 1;
}


uint16_t uartb_rx_bytesavailable(void)
{
int16_t d;

  d = (int16_t)uartb_rxwritepos - (int16_t)uartb_rxreadpos;
  return (d < 0) ? d + (UARTB_RXBUFSIZEMASK + 1) : d;
}


char uartb_getc(void)
{
  while (uartb_rxwritepos == uartb_rxreadpos) {};
  uartb_rxreadpos = (uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK;
  return uartb_rxbuf[uartb_rxreadpos];
}


static inline char uartb_lookatnextc(void)
{
  return uartb_rxbuf[(uartb_rxreadpos + 1) & UARTB_RXBUFSIZEMASK];
}


static inline void uartb_rx_flush(void)
{
  uartb_rxwritepos = uartb_rxreadpos = 0;
}

#endif // defined UARTB_USE_RX


//-------------------------------------------------------
// INIT routines
//-------------------------------------------------------

#if !(defined UARTB_USE_LPUART1 || defined UARTB_USE_LPUART1_REMAPPED) // for the moment, don't allow it for LPUART

void uartb_setprotocol(uint32_t baud, UARTPARITYENUM parity, UARTSTOPBITENUM stopbits)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.DataWidth = (parity != LL_USART_PARITY_NONE) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = stopbits;
  USART_InitStruct.Parity = parity;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_Enable(UARTB_UARTx);
}


void uartb_setbaudrate(uint32_t baud)
{
LL_USART_InitTypeDef USART_InitStruct = {0};

  LL_USART_StructInit(&USART_InitStruct);
  USART_InitStruct.BaudRate = baud;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  LL_USART_Disable(UARTB_UARTx); // must be disabled to configure some registers
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_Enable(UARTB_UARTx);
}


void uartb_tx_enable(FunctionalState flag)
{
#ifdef UARTB_USE_TX
  if (flag == ENABLE) {
    gpio_change_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
  } else {
    gpio_change(UARTB_TX_IO, IO_MODE_INPUT_ANALOG, IO_SPEED_VERYFAST);
  }
#endif
}

#endif


void uartb_rx_enableisr(FunctionalState flag)
{
#ifdef UARTB_USE_RX
  if (flag == ENABLE) {
    // Enable Receive Data register not empty interrupt
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
    LL_USART_EnableIT_RXNE(UARTB_UARTx);
  } else {
    LL_USART_DisableIT_RXNE(UARTB_UARTx);
#if defined STM32F1
    LL_USART_ClearFlag_RXNE(UARTB_UARTx);
#endif
  }
#endif
}


void uartb_init_isroff(void)
{
  LL_USART_Disable(UARTB_UARTx);

  // Initialize clocks for USART/LPUART, GPIO, AFIO
  rcc_init_afio();
  rcc_init_uart(UARTB_UARTx);
#ifdef STM32F1
#if defined UARTB_USE_UART1_REMAPPED
  LL_GPIO_AF_EnableRemap_USART1();
#endif
#if defined UARTB_USE_UART2_REMAPPED
  LL_GPIO_AF_EnableRemap_USART2();
#endif
#if defined UARTB_USE_UART3_REMAPPED
  LL_GPIO_AF_RemapPartial_USART3();
#endif
#endif

  // Configure pin USART/LPUART Tx as alternative function push-pull
#ifdef UARTB_USE_TX
  gpio_init_af(UARTB_TX_IO, IO_MODE_OUTPUT_ALTERNATE_PP, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure pin USART/LPUART Rx as input with pull up
#ifdef UARTB_USE_RX
  gpio_init_af(UARTB_RX_IO, IO_MODE_INPUT_PU, UARTB_IO_AF, IO_SPEED_VERYFAST);
#endif

  // Configure USART/LPUART
#if !(defined UARTB_USE_LPUART1 || defined UARTB_USE_LPUART1_REMAPPED)
LL_USART_InitTypeDef USART_InitStruct = {0};
  USART_InitStruct.BaudRate = UARTB_BAUD;
  USART_InitStruct.DataWidth = LL_USART_DATAWIDTH_8B;
  USART_InitStruct.StopBits = LL_USART_STOPBITS_1;
  USART_InitStruct.Parity = LL_USART_PARITY_NONE;
  USART_InitStruct.TransferDirection = LL_USART_DIRECTION_TX_RX;
  USART_InitStruct.HardwareFlowControl = LL_USART_HWCONTROL_NONE;
  USART_InitStruct.OverSampling = LL_USART_OVERSAMPLING_16;
#if defined STM32G4
  USART_InitStruct.PrescalerValue = LL_USART_PRESCALER_DIV1;
#endif
  LL_USART_Init(UARTB_UARTx, &USART_InitStruct);
  LL_USART_ConfigAsyncMode(UARTB_UARTx);
#if defined STM32G4
  LL_USART_DisableFIFO(UARTB_UARTx);
  LL_USART_SetTXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
  LL_USART_SetRXFIFOThreshold(UARTB_UARTx, LL_USART_FIFOTHRESHOLD_1_8);
#endif
#else
LL_LPUART_InitTypeDef LPUART_InitStruct = {0};
  LPUART_InitStruct.BaudRate = UARTB_BAUD;
  LPUART_InitStruct.DataWidth = LL_LPUART_DATAWIDTH_8B;
  LPUART_InitStruct.StopBits = LL_LPUART_STOPBITS_1;
  LPUART_InitStruct.Parity = LL_LPUART_PARITY_NONE;
  LPUART_InitStruct.TransferDirection = LL_LPUART_DIRECTION_TX_RX;
  LPUART_InitStruct.HardwareFlowControl = LL_LPUART_HWCONTROL_NONE;
  LPUART_InitStruct.PrescalerValue = LL_LPUART_PRESCALER_DIV1;
  LL_LPUART_Init(UARTB_UARTx, &LPUART_InitStruct);
  LL_LPUART_DisableFIFO(UARTB_UARTx);
  LL_LPUART_SetTXFIFOThreshold(UARTB_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
  LL_LPUART_SetRXFIFOThreshold(UARTB_UARTx, LL_LPUART_FIFOTHRESHOLD_1_8);
#endif

  // Configure NVIC channel
#if defined UARTB_USE_RX || defined UARTB_USE_TX_ISR
#ifdef UARTB_PREEMPTIONPRIORITY
  #error Legacy UARTB_PREEMPTIONPRIORITY used !
#endif
#ifdef UARTB_SUBPRIORITY
  #error Legacy UARTB_SUBPRIORITY used !
#endif
#ifdef UARTB_PRIORITY
#error Legacy UARTB_PRIORITY used !
#endif
#ifndef UARTB_IRQ_PRIORITY
  #define UARTB_IRQ_PRIORITY  15 // set priority to lowest
#endif
  nvic_irq_enable_w_priority(UARTB_IRQn, UARTB_IRQ_PRIORITY);
#endif

#ifdef UARTB_USE_TX_ISR
  // Disable Transmit Data Register empty interrupt
  LL_USART_DisableIT_TXE(UARTB_UARTx);
  LL_USART_ClearFlag_TC(UARTB_UARTx);
  // Flush buffer
  uartb_txwritepos = uartb_txreadpos = 0;
#endif

